Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotQuantityType
The Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotQuantityType enum defines the used values from the untQuantityTypes_e enum of TS Core.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotQuantityType.None
The associated value does not represent a quantity.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotQuantityType.AngleUnit
The associated value represents an angle.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotQuantityType.LengthUnit
The associated value represents a length.